particle-iot/device-os/hal/src/stm32f2xx/usart_hal.c
    if ((config & SERIAL_FLOW_CONTROL) && !hardwareFlowControlSupported(serial)) {
        return false;
    }

    return true;
}

void configureTransmitReceive(hal_usart_interface_t serial, uint8_t transmit, uint8_t receive) {
    uint32_t toset = 0;
    if (transmit) {
        toset |= ((uint32_t)USART_CR1_TE);
    }
    if (receive) {
        toset |= ((uint32_t)USART_CR1_RE);
    }
    uint32_t tmp = usartMap[serial]->peripheral->CR1;
    if ((tmp & ((uint32_t)(USART_CR1_TE | USART_CR1_RE))) != toset) {
        tmp &= ~((uint32_t)(USART_CR1_TE | USART_CR1_RE));
        tmp |= toset;
        usartMap[serial]->peripheral->CR1 = tmp;
    }
}

void configurePinsMode(hal_usart_interface_t serial, uint32_t config) {
    if ((config & SERIAL_HALF_DUPLEX) == 0) {
        // Full duplex with push-pull
        HAL_Pin_Mode(usartMap[serial]->rx_pin, AF_OUTPUT_PUSHPULL);
        HAL_Pin_Mode(usartMap[serial]->tx_pin, AF_OUTPUT_PUSHPULL);
    } else if ((config & SERIAL_OPEN_DRAIN)) {
        // Half-duplex with open drain
        HAL_Pin_Mode(usartMap[serial]->rx_pin, INPUT);
        HAL_Pin_Mode(usartMap[serial]->tx_pin, AF_OUTPUT_DRAIN);
    } else {
        // Half-duplex with push-pull
        /* RM0033 24.3.10:
         * The TX pin is always released when no data is transmitted. Thus, it acts as a standard
         * I/O in idle or in reception. It means that the I/O must be configured so that TX is
         * configured as floating input (or output high open-drain) when not driven by the USART
         */
        HAL_Pin_Mode(usartMap[serial]->rx_pin, INPUT);
        HAL_Pin_Mode(usartMap[serial]->tx_pin, AF_OUTPUT_PUSHPULL);
        if (config & SERIAL_TX_PULL_UP) {
            // We ought to allow enabling pull-up or pull-down through HAL somehow
            Hal_Pin_Info* PIN_MAP = HAL_Pin_Map();
            pin_t gpio_pin = PIN_MAP[usartMap[serial]->tx_pin].gpio_pin;
            GPIO_TypeDef *gpio_port = PIN_MAP[usartMap[serial]->tx_pin].gpio_peripheral;
            GPIO_InitTypeDef GPIO_InitStructure = {0};
            GPIO_InitStructure.GPIO_Pin = gpio_pin;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
            GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
            GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
            GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
            GPIO_Init(gpio_port, &GPIO_InitStructure);
        }
    }
}

bool hardwareFlowControlSupported(hal_usart_interface_t serial) {
    return (usartMap[serial]->rts_pin != PIN_INVALID) && (usartMap[serial]->cts_pin != PIN_INVALID);
}

void usartEndImpl(hal_usart_interface_t serial, bool end) {
    Hal_Pin_Info* PIN_MAP = HAL_Pin_Map();
    if (usartMap[serial]->conf.config & SERIAL_FLOW_CONTROL_RTS) {
        // nRTS is still under control of USART peripheral, release it.
        GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->rts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->rts_pin].gpio_pin_source, 0/*default after reset*/);
        HAL_Pin_Mode(usartMap[serial]->rts_pin, OUTPUT);
        HAL_GPIO_Write(usartMap[serial]->rts_pin, 1);
    }

    // Wait for transmission of outgoing data
    while (usartMap[serial]->tx_buffer->head != usartMap[serial]->tx_buffer->tail);

    // Disable the USART
    USART_Cmd(usartMap[serial]->peripheral, DISABLE);

    // Disable LIN mode
    USART_LINCmd(usartMap[serial]->peripheral, DISABLE);

    // Deinitialise USART
    USART_DeInit(usartMap[serial]->peripheral);

    // Disable USART Receive and Transmit interrupts
    USART_ITConfig(usartMap[serial]->peripheral, USART_IT_RXNE, DISABLE);
    USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TXE, DISABLE);

    NVIC_InitTypeDef NVIC_InitStructure;

    // Disable the USART Interrupt
    NVIC_InitStructure.NVIC_IRQChannel = usartMap[serial]->int_n;
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;

    NVIC_Init(&NVIC_InitStructure);

    // Disable USART Clock
    *usartMap[serial]->apb_reg &= ~usartMap[serial]->clock_enabled;

    GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->rx_pin].gpio_peripheral, usartMap[serial]->rx_pinsource, 0);
    GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->tx_pin].gpio_peripheral, usartMap[serial]->tx_pinsource, 0);

    // Switch pins to INPUT
    HAL_Pin_Mode(usartMap[serial]->rx_pin, INPUT);
    HAL_Pin_Mode(usartMap[serial]->tx_pin, end ? INPUT : INPUT_PULLUP);

    if (usartMap[serial]->conf.config & SERIAL_FLOW_CONTROL_RTS) {
        // NOTE: AF setting has already been reset above
        HAL_Pin_Mode(usartMap[serial]->rts_pin, end ? INPUT : INPUT_PULLUP);
    }

    if (usartMap[serial]->conf.config & SERIAL_FLOW_CONTROL_CTS) {
        GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->cts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->cts_pin].gpio_pin_source, 0);
        HAL_Pin_Mode(usartMap[serial]->cts_pin, INPUT);
    }
}

void hal_usart_init(hal_usart_interface_t serial, hal_usart_ring_buffer_t *rx_buffer, hal_usart_ring_buffer_t *tx_buffer) {
    usartMap[serial]->configured = false;

    if (serial == HAL_USART_SERIAL1) {
        usartMap[serial] = &USART_MAP[USART_TX_RX];
    } else if (serial == HAL_USART_SERIAL2) {
        usartMap[serial] = &USART_MAP[USART_RGBG_RGBB];
    }
#if PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
    else if (serial == HAL_USART_SERIAL3) {
        usartMap[serial] = &USART_MAP[USART_TXD_UC_RXD_UC];
    } else if (serial == HAL_USART_SERIAL4) {
        usartMap[serial] = &USART_MAP[USART_C3_C2];
    } else if (serial == HAL_USART_SERIAL5) {
        usartMap[serial] = &USART_MAP[USART_C1_C0];
    }
#endif // PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION

    usartMap[serial]->rx_buffer = rx_buffer;
    usartMap[serial]->tx_buffer = tx_buffer;

    memset(usartMap[serial]->rx_buffer, 0, sizeof(hal_usart_ring_buffer_t));
    memset(usartMap[serial]->tx_buffer, 0, sizeof(hal_usart_ring_buffer_t));

    usartMap[serial]->state = HAL_USART_STATE_DISABLED;
    usartMap[serial]->transmitting = false;

    usartMap[serial]->configured = true;
}

