particle-iot/device-os/hal/src/stm32f2xx/usart_hal.c
void hal_usart_begin(hal_usart_interface_t serial, uint32_t baud) {
    hal_usart_begin_config(serial, baud, 0, 0); // Default serial configuration is 8N1
}

void hal_usart_begin_config(hal_usart_interface_t serial, uint32_t baud, uint32_t config, void *ptr) {
    if (!usartMap[serial]->configured) {
        return;
    }
    // Verify UART configuration, exit if it's invalid.
    if (!validateConfig(serial, config)) {
        return;
    }

    USART_DeInit(usartMap[serial]->peripheral);
    usartMap[serial]->state = HAL_USART_STATE_DISABLED;

    configurePinsMode(serial, config);

    // Enable USART Clock
    *usartMap[serial]->apb_reg |=  usartMap[serial]->clock_enabled;

    // Connect USART pins to AFx
    Hal_Pin_Info* PIN_MAP = HAL_Pin_Map();
    GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->rx_pin].gpio_peripheral, usartMap[serial]->rx_pinsource, usartMap[serial]->af_map);
    GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->tx_pin].gpio_peripheral, usartMap[serial]->tx_pinsource, usartMap[serial]->af_map);

    // NVIC Configuration
    NVIC_InitTypeDef NVIC_InitStructure;
    // Enable the USART Interrupt
    NVIC_InitStructure.NVIC_IRQChannel = usartMap[serial]->int_n;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 7;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    // USART default configuration
    // USART configured as follow:
    // - BaudRate = (set baudRate as 9600 baud)
    // - Word Length = 8 Bits
    // - One Stop Bit
    // - No parity
    // - Hardware flow control disabled for Serial1/2/4/5
    // - Hardware flow control enabled (RTS and CTS signals) for Serial3
    // - Receive and transmit enabled
    // USART configuration
    usartInitStructure.USART_BaudRate = baud;
    usartInitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

    // Flow control configuration
    switch (config & SERIAL_FLOW_CONTROL) {
        case SERIAL_FLOW_CONTROL_CTS: {
            usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_CTS;
            break;
        }
        case SERIAL_FLOW_CONTROL_RTS: {
            usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS;
            break;
        }
        case SERIAL_FLOW_CONTROL_RTS_CTS: {
            usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
            break;
        }
        case SERIAL_FLOW_CONTROL_NONE:
        default: {
            usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
            break;
        }
    }

    if (serial == HAL_USART_SERIAL1) {
        // USART1 supports hardware flow control, but RTS and CTS pins are not exposed
        usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    }

#if PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
    if (serial == HAL_USART_SERIAL4 || serial == HAL_USART_SERIAL5) {
        // UART4 and UART5 do not support hardware flow control
        usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    }
#endif // PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION

#if USE_USART3_HARDWARE_FLOW_CONTROL_RTS_CTS    // Electron
    if (serial == HAL_USART_SERIAL3) {
        usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
    }
#endif

    switch (usartInitStructure.USART_HardwareFlowControl) {
        case USART_HardwareFlowControl_CTS: {
            HAL_Pin_Mode(usartMap[serial]->cts_pin, AF_OUTPUT_PUSHPULL);
            GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->cts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->cts_pin].gpio_pin_source, usartMap[serial]->af_map);
            break;
        }
        case USART_HardwareFlowControl_RTS: {
            HAL_Pin_Mode(usartMap[serial]->rts_pin, AF_OUTPUT_PUSHPULL);
            GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->rts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->rts_pin].gpio_pin_source, usartMap[serial]->af_map);
            break;
        }
        case USART_HardwareFlowControl_RTS_CTS: {
            HAL_Pin_Mode(usartMap[serial]->cts_pin, AF_OUTPUT_PUSHPULL);
            HAL_Pin_Mode(usartMap[serial]->rts_pin, AF_OUTPUT_PUSHPULL);
            GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->cts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->cts_pin].gpio_pin_source, usartMap[serial]->af_map);
            GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->rts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->rts_pin].gpio_pin_source, usartMap[serial]->af_map);
            break;
        }
        case USART_HardwareFlowControl_None:
        default: {
            break;
        }
    }

    // Stop bit configuration.
    switch (config & SERIAL_STOP_BITS) {
        case SERIAL_STOP_BITS_1: { // 1 stop bit
            usartInitStructure.USART_StopBits = USART_StopBits_1;
            break;
        }
        case SERIAL_STOP_BITS_2: { // 2 stop bits
            usartInitStructure.USART_StopBits = USART_StopBits_2;
            break;
        }
        case SERIAL_STOP_BITS_0_5: { // 0.5 stop bits
            usartInitStructure.USART_StopBits = USART_StopBits_0_5;
            break;
        }
        case SERIAL_STOP_BITS_1_5: { // 1.5 stop bits
            usartInitStructure.USART_StopBits = USART_StopBits_1_5;
            break;
        }
        default: {
            break;
        }
    }

    // Data bits configuration
    switch (calculateWordLength(config, 0)) {
        case 8: {
            usartInitStructure.USART_WordLength = USART_WordLength_8b;
            break;
        }
        case 9: {
            usartInitStructure.USART_WordLength = USART_WordLength_9b;
            break;
        }
        default: {
            break;
        }
    }

    // Parity configuration
    switch (config & SERIAL_PARITY) {
        case SERIAL_PARITY_NO: {
            usartInitStructure.USART_Parity = USART_Parity_No;
            break;
        }
        case SERIAL_PARITY_EVEN: {
            usartInitStructure.USART_Parity = USART_Parity_Even;
            break;
        }
        case SERIAL_PARITY_ODD: {
            usartInitStructure.USART_Parity = USART_Parity_Odd;
            break;
        }
        default: {
            break;
        }
    }

    // Disable LIN mode just in case
    USART_LINCmd(usartMap[serial]->peripheral, DISABLE);

    // Configure USART
    USART_Init(usartMap[serial]->peripheral, &usartInitStructure);

    // LIN configuration
    if (config & LIN_MODE) {
        // Enable break detection
        switch (config & LIN_BREAK_BITS) {
            case LIN_BREAK_10B: {
                USART_LINBreakDetectLengthConfig(usartMap[serial]->peripheral, USART_LINBreakDetectLength_10b);
                break;
            }
            case LIN_BREAK_11B: {
                USART_LINBreakDetectLengthConfig(usartMap[serial]->peripheral, USART_LINBreakDetectLength_11b);
                break;
            }
            default: {
                break;
            }
        }
    }

    usartMap[serial]->conf.baud_rate = baud;
    usartMap[serial]->conf.config = config;
    if (config & SERIAL_HALF_DUPLEX) {
        hal_usart_half_duplex(serial, ENABLE);
    }

    USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TC, DISABLE);

