particle-iot/device-os/hal/src/stm32f2xx/usart_hal.c
    // Enable the USART
    USART_Cmd(usartMap[serial]->peripheral, ENABLE);

    if (config & LIN_MODE) {
        USART_LINCmd(usartMap[serial]->peripheral, ENABLE);
    }

    usartMap[serial]->state = HAL_USART_STATE_ENABLED;
    usartMap[serial]->transmitting = false;

    // Enable USART Receive and Transmit interrupts
    USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TXE, ENABLE);
    USART_ITConfig(usartMap[serial]->peripheral, USART_IT_RXNE, ENABLE);
}

void hal_usart_end(hal_usart_interface_t serial) {
    if (usartMap[serial]->state == HAL_USART_STATE_DISABLED) {
        // Invalid state
        return;
    }
    usartEndImpl(serial, true);

    // clear any received data
    usartMap[serial]->rx_buffer->head = usartMap[serial]->rx_buffer->tail;
    // Undo any pin re-mapping done for this USART
    // ...
    memset(usartMap[serial]->rx_buffer, 0, sizeof(hal_usart_ring_buffer_t));
    memset(usartMap[serial]->tx_buffer, 0, sizeof(hal_usart_ring_buffer_t));

    usartMap[serial]->state = HAL_USART_STATE_DISABLED;
    usartMap[serial]->transmitting = false;
    usartMap[serial]->conf.baud_rate = 0;
    usartMap[serial]->conf.config = 0;
}

uint32_t hal_usart_write(hal_usart_interface_t serial, uint8_t data) {
    return hal_usart_write_nine_bits(serial, data);
}

uint32_t hal_usart_write_nine_bits(hal_usart_interface_t serial, uint16_t data) {
    // Remove any bits exceeding data bits configured
    data &= calculateDataBitsMask(usartMap[serial]->conf.config);
    // interrupts are off and data in queue;
    if ((USART_GetITStatus(usartMap[serial]->peripheral, USART_IT_TXE) == RESET)
        && usartMap[serial]->tx_buffer->head != usartMap[serial]->tx_buffer->tail) {
        // Get him busy
        USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TXE, ENABLE);
    }

    unsigned i = (usartMap[serial]->tx_buffer->head + 1) % SERIAL_BUFFER_SIZE;

    // If the output buffer is full, there's nothing for it other than to
    // wait for the interrupt handler to empty it a bit
    // no space so or Called Off Panic with interrupt off get the message out!
    // make space Enter Polled IO mode
    while (i == usartMap[serial]->tx_buffer->tail || ((__get_PRIMASK() & 1) && usartMap[serial]->tx_buffer->head != usartMap[serial]->tx_buffer->tail) ) {
        // Interrupts are on but they are not being serviced because this was called from a higher
        // Priority interrupt
        if (USART_GetITStatus(usartMap[serial]->peripheral, USART_IT_TXE) && USART_GetFlagStatus(usartMap[serial]->peripheral, USART_FLAG_TXE)) {
            // protect for good measure
            USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TXE, DISABLE);
            // Write out a byte
            USART_SendData(usartMap[serial]->peripheral,  usartMap[serial]->tx_buffer->buffer[usartMap[serial]->tx_buffer->tail++]);
            usartMap[serial]->tx_buffer->tail %= SERIAL_BUFFER_SIZE;
            // unprotect
            USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TXE, ENABLE);
        }
    }

    usartMap[serial]->tx_buffer->buffer[usartMap[serial]->tx_buffer->head] = data;
    usartMap[serial]->tx_buffer->head = i;
    usartMap[serial]->transmitting = true;
    USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TXE, ENABLE);

    return 1;
}

int32_t hal_usart_available(hal_usart_interface_t serial) {
    return (unsigned int)(SERIAL_BUFFER_SIZE + usartMap[serial]->rx_buffer->head - usartMap[serial]->rx_buffer->tail) % SERIAL_BUFFER_SIZE;
}

int32_t hal_usart_available_data_for_write(hal_usart_interface_t serial) {
    int32_t tail = usartMap[serial]->tx_buffer->tail;
    int32_t available = SERIAL_BUFFER_SIZE - (usartMap[serial]->tx_buffer->head >= tail ?
                                              usartMap[serial]->tx_buffer->head - tail :
                                              (SERIAL_BUFFER_SIZE + usartMap[serial]->tx_buffer->head - tail) - 1);

    return available;
}


int32_t hal_usart_read(hal_usart_interface_t serial) {
    // if the head isn't ahead of the tail, we don't have any characters
    if (usartMap[serial]->rx_buffer->head == usartMap[serial]->rx_buffer->tail) {
        return -1;
    } else {
        uint16_t c = usartMap[serial]->rx_buffer->buffer[usartMap[serial]->rx_buffer->tail];
        usartMap[serial]->rx_buffer->tail = (unsigned int)(usartMap[serial]->rx_buffer->tail + 1) % SERIAL_BUFFER_SIZE;
        return c;
    }
}

int32_t hal_usart_peek(hal_usart_interface_t serial) {
    if (usartMap[serial]->rx_buffer->head == usartMap[serial]->rx_buffer->tail) {
        return -1;
    } else {
        return usartMap[serial]->rx_buffer->buffer[usartMap[serial]->rx_buffer->tail];
    }
}

void hal_usart_flush(hal_usart_interface_t serial) {
    // Loop until USART DR register is empty
    while ( usartMap[serial]->tx_buffer->head != usartMap[serial]->tx_buffer->tail );
    // Loop until last frame transmission complete
    while (usartMap[serial]->transmitting && (USART_GetFlagStatus(usartMap[serial]->peripheral, USART_FLAG_TC) == RESET));
    usartMap[serial]->transmitting = false;
}

bool hal_usart_is_enabled(hal_usart_interface_t serial) {
    return usartMap[serial]->state == HAL_USART_STATE_ENABLED;
}

void hal_usart_half_duplex(hal_usart_interface_t serial, bool enable) {
    if (hal_usart_is_enabled(serial)) {
        USART_Cmd(usartMap[serial]->peripheral, DISABLE);
    }

    if (enable) {
        usartMap[serial]->conf.config |= SERIAL_HALF_DUPLEX;
    } else {
        usartMap[serial]->conf.config &= ~(SERIAL_HALF_DUPLEX);
    }
    configurePinsMode(serial, usartMap[serial]->conf.config);

    // These bits need to be cleared according to the reference manual
    usartMap[serial]->peripheral->CR2 &= ~(USART_CR2_LINEN | USART_CR2_CLKEN);
    usartMap[serial]->peripheral->CR3 &= ~(USART_CR3_IREN | USART_CR3_SCEN);
    USART_HalfDuplexCmd(usartMap[serial]->peripheral, enable ? ENABLE : DISABLE);


    if (hal_usart_is_enabled(serial)) {
        USART_Cmd(usartMap[serial]->peripheral, ENABLE);
    }
}

void hal_usart_send_break(hal_usart_interface_t serial, void* reserved) {
    int32_t state = HAL_disable_irq();
    while((usartMap[serial]->peripheral->CR1 & USART_CR1_SBK) == SET);
    USART_SendBreak(usartMap[serial]->peripheral);
    while((usartMap[serial]->peripheral->CR1 & USART_CR1_SBK) == SET);
    HAL_enable_irq(state);
}

uint8_t hal_usart_break_detected(hal_usart_interface_t serial) {
    if (USART_GetFlagStatus(usartMap[serial]->peripheral, USART_FLAG_LBD)) {
        // Clear LBD flag
        USART_ClearFlag(usartMap[serial]->peripheral, USART_FLAG_LBD);
        return 1;
    }
    return 0;
}

// Shared Interrupt Handler for USART2/Serial1 and USART1/Serial2
// WARNING: This function MUST remain reentrance compliant -- no local static variables etc.
static void usartIntHandler(hal_usart_interface_t serial) {
    if (USART_GetITStatus(usartMap[serial]->peripheral, USART_IT_RXNE) != RESET) {
        // Read byte from the receive data register
        uint16_t c = USART_ReceiveData(usartMap[serial]->peripheral);
        // Remove parity bits from data
        c &= calculateDataBitsMask(usartMap[serial]->conf.config);
        storeChar(c, usartMap[serial]->rx_buffer);
    }

    uint8_t noecho = (usartMap[serial]->conf.config & (SERIAL_HALF_DUPLEX | SERIAL_HALF_DUPLEX_NO_ECHO)) == (SERIAL_HALF_DUPLEX | SERIAL_HALF_DUPLEX_NO_ECHO);

    if (USART_GetITStatus(usartMap[serial]->peripheral, USART_IT_TC) != RESET) {
        if (noecho) {
            USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TC, DISABLE);
            configureTransmitReceive(serial, 0, 1);
        }
    }

    if (USART_GetITStatus(usartMap[serial]->peripheral, USART_IT_TXE) != RESET) {
        // Write byte to the transmit data register
        if (usartMap[serial]->tx_buffer->head == usartMap[serial]->tx_buffer->tail) {
            // Buffer empty, so disable the USART Transmit interrupt
            USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TXE, DISABLE);
            if (noecho) {
                USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TC, ENABLE);
            }
        } else {
            if (noecho) {
                configureTransmitReceive(serial, 1, 0);
            }
            // There is more data in the output buffer. Send the next byte
            USART_SendData(usartMap[serial]->peripheral, usartMap[serial]->tx_buffer->buffer[usartMap[serial]->tx_buffer->tail++]);
            usartMap[serial]->tx_buffer->tail %= SERIAL_BUFFER_SIZE;
        }
    }

