particle-iot/device-os/hal/src/stm32f2xx/usart_hal.c
    if (USART_GetFlagStatus(usartMap[serial]->peripheral, USART_FLAG_ORE) != RESET) {
        // If Overrun flag is still set, clear it
        (void)USART_ReceiveData(usartMap[serial]->peripheral);
    }
}

int hal_usart_sleep(hal_usart_interface_t serial, bool sleep, void* reserved) {
    if (sleep) {
        CHECK_TRUE(usartMap[serial]->state == HAL_USART_STATE_ENABLED, SYSTEM_ERROR_INVALID_STATE);
        hal_usart_flush(serial);
        usartEndImpl(serial, false);
        memset(usartMap[serial]->tx_buffer, 0, sizeof(hal_usart_ring_buffer_t));
        usartMap[serial]->state = HAL_USART_STATE_SUSPENDED;
        usartMap[serial]->transmitting = false;
    } else {
        CHECK_TRUE(usartMap[serial]->state == HAL_USART_STATE_SUSPENDED, SYSTEM_ERROR_INVALID_STATE);
        hal_usart_begin_config(serial, usartMap[serial]->conf.baud_rate, usartMap[serial]->conf.config, NULL);
    }
    return SYSTEM_ERROR_NONE;
}

// Serial1 interrupt handler
/*******************************************************************************
 * Function Name  : HAL_USART1_Handler
 * Description    : This function handles USART1 global interrupt request.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void HAL_USART1_Handler(void) {
    usartIntHandler(HAL_USART_SERIAL1);
}

// Serial2 interrupt handler
/*******************************************************************************
 * Function Name  : HAL_USART2_Handler
 * Description    : This function handles USART2 global interrupt request.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void HAL_USART2_Handler(void) {
    usartIntHandler(HAL_USART_SERIAL2);
}

#if PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION

#if 0
// Serial3 interrupt handler
/*******************************************************************************
 * Function Name  : HAL_USART3_Handler
 * Description    : This function handles USART3 global interrupt request.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void HAL_USART3_Handler(void) {
    usartIntHandler(HAL_USART_SERIAL3);
}
#endif

// Serial4 interrupt handler
/*******************************************************************************
 * Function Name  : HAL_USART4_Handler
 * Description    : This function handles UART4 global interrupt request.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void HAL_USART4_Handler(void) {
    usartIntHandler(HAL_USART_SERIAL4);
}

// Serial5 interrupt handler
/*******************************************************************************
 * Function Name  : HAL_USART5_Handler
 * Description    : This function handles UART5 global interrupt request.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void HAL_USART5_Handler(void) {
    usartIntHandler(HAL_USART_SERIAL5);
}

#endif // PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
